In [1]:
import pandas as pd

In [4]:
data={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [5]:
df

    Person  Sales company
0      Sam    200    GOOG
1  Charlie    120    GOOG
2      Amy    340    MSFT
3  Vanessa    124    MSFT
4     Carl    243      FB
5    Sarah    350      FB

In [24]:
df.head()

    Person  Sales company
0      Sam    200    GOOG
1  Charlie    120    GOOG
2      Amy    340    MSFT
3  Vanessa    124    MSFT
4     Carl    243      FB

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Person     6 non-null object
Sales      6 non-null int64
company    6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [29]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [31]:
by_comp.describe().transpose()

company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [8]:
by_comp = df.groupby("company")
by_comp

In [9]:
by_comp.mean()

         Sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
by_comp.std()

              Sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [11]:
by_comp.var()

           Sales
company
FB        5724.5
GOOG      3200.0
MSFT     23328.0

In [23]:
df.groupby('company').sum()

         Sales
company
FB         593
GOOG       320
MSFT       464

# DataFrame 2

In [32]:
df1 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df1

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [34]:
df1['col2'].unique()

array([444, 555, 666], dtype=int64)

In [36]:
df1['col2'].nunique()

3

In [38]:
df1['col2'].value_counts() #no. of times the value is occuring

444    2
555    1
666    1
Name: col2, dtype: int64

In [40]:
new_df=df1[(df1['col1']>2) & (df1['col2']==444)]
new_df

   col1  col2 col3
3     4   444  xyz

In [42]:
def mul(x):
    return x*2
df1['col2'].apply(mul)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [47]:
df1['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [52]:
df1['col1'].sum()

10

In [53]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [54]:
df1.columns

Index(['col1', 'col2', 'col3'], dtype='object')